Repository: hubkit-sandbox/search-core
Catalog: Resources/translations/RollerworksSearch.*.xlf
Languages: nl

source: FieldIdentification
nl: veldidentificatie

source: StringValue
nl: tekstwaarde

source: CompareOperator
nl: vergelijk-operator

source: Range
nl: bereik

source: ExcludedValue
nl: uitgesloten waarde

source: ExcludedRange
nl: uitgesloten bereik

source: Compare
nl: vergelijking

source: PatternMatch
nl: patroonvergelijking

source: end of string
nl: einde van tekst

source: line end
nl: lijn einde

source: lower
nl: onderste

source: upper
nl: bovenste

source: At root level, group {{ group }}:
nl: Op hoofdniveau, groep {{ group }}:

source: At root level, field {{ field }}:
nl: Op hoofdniveau, veld {{ field }}:

source: At root level, field {{ field }} value position {{ position }} {{ type }}:
nl: Op hoofdniveau, veld {{ field }} waarde positie {{ position }} {{ type }}:

source: At root level, field {{ field }} value position {{ position }}:
nl: Op hoofdniveau, veld {{ field }} waarde positie {{ position }}:

source: In nested group {{ group }}, field {{ field }} value position {{ position }} {{ type }}:
nl: In geneste groep {{ group }}, veld {{ field }} waarde positie {{ position }} {{ type }}:

source: In nested group {{ group }}, field {{ field }} value position {{ position }}:
nl: In geneste groep {{ group }}, veld {{ field }} waarde positie {{ position }}:

source: In nested group {{ group }}, field {{ field }}:
nl: In geneste groep {{ group }}, veld {{ field }}:

source: In group {{ group }}, field {{ field }} value position {{ position }} {{ type }}:
nl: In groep {{ group }}, veld {{ field }} waarde positie {{ position }} {{ type }}:

source: In group {{ group }}, field {{ field }} value position {{ position }}:
nl: In groep {{ group }}, veld {{ field }} waarde positie {{ position }}:

source: In group {{ group }}, field {{ field }}:
nl: In groep {{ group }}, veld {{ field }}:

source: Nested group {{ group }}:
nl: Geneste groep {{ group }}:

source: Group {{ group }}:
nl: Groep {{ group }}:

# STRING_SYNTAX_ERROR_EXPECTED
source: [Syntax Error] line {{ line }} col {{ column }}: Expected {{ expected }}, got {{ got }}.
nl: [Syntaxisfout] regel {{ line }} kolom {{ column }}: Verwacht {{ expected }}, kreeg {{ got }}.

# STRING_SYNTAX_ERROR_UNEXPECTED
source: [Syntax Error] line {{ line }} col {{ column }}: Unexpected {{ unexpected }}.
nl: [Syntaxisfout] regel {{ line }} kolom {{ column }}: Onverwachte {{ unexpected }}.

# STRING_FORMAT_ERROR
source: [Format Error] line {{ line }} col {{ column }}: {{ message }}.
nl: [Opmaakfout] regel {{ line }} kolom {{ column }}: {{ message }}.

# FIELD_REQUIRES_VALUES
source: A field must have at least one value
nl: Een veld moet ten minste één waarde hebben.

# INCORRECT_VALUES_SEPARATOR
source: Values must be separated by a ",". A values list must end with ";" or ")"
nl: Waardes moeten gescheiden zijn met een ",". Een waarden lijst moet eindigen met ";" of ")".

# CANNOT_CLOSE_UNOPENED_GROUP
source: Cannot close group as this field is not in a group
nl: Kan groep niet sluiten omdat dit veld zich niet in een groep bevindt

# GROUP_LOGICAL_WITHOUT_GROUP
source: A group logical operator can only be used at the start of the input or before a group opening
nl: Een groepslogische operator kan alleen aan het begin van de invoer of vóór een groepsopening worden gebruikt

# UNKNOWN_PATTERN_MATCH_FLAG
source: Unknown operator flag, expected "i" and/or "!"
nl: Onbekende operator vlag, verwacht "i" en/of "!"

# NO_SPACES_IN_OPERATOR
source: Spaces are not allowed within an operator
nl: Spaties zijn niet toegestaan binnen een operator

# INCOMPLETE_VALUE_PATTERN
source: Missing operator and value pattern
nl: Ontbrekende operator en waardepatroon

# SPACES_REQ_QUOTING
source: A value containing spaces must be surrounded by quotes
nl: Een waarde met spaties, moet tussen aanhalingstekens worden geplaatst

# SPECIAL_CHARS_REQ_QUOTING
source: A value containing special characters must be surrounded by quotes
nl: Een waarde met speciale tekens, moet tussen aanhalingstekens worden geplaatst

# QUOTED_VALUE_REQUIRE_QUOTING
source: A value containing quotes must be surrounded by quotes
nl: Een waarde met aanhalingstekens, moet tussen aanhalingstekens worden geplaatst

# VALUE_QUOTES_MUST_ESCAPE
source: Quotes in a quoted value must be escaped
nl: Aanhalingstekens in een aangehaalde waarde moeten worden geëscaped

# MISSING_END_QUOTE
source: Missing quote to end the value
nl: Ontbrekend aanhalingsteken om de waarde te beëindigen
