Repository: hubkit-sandbox/search-core
Catalog: Resources/translations/validators.*.xlf
Languages: nl

source: No default field configured. Please provide a field name.
nl: Geen standaard veld geconfigureerd. Vul een veldnaam in.

source: The field {{ field }} is not registered in the FieldSet or available as alias.
nl: Veld {{ field }} is niet geregistreerd in de velden set en is niet beschikbaar als alias.

source: The field {{ field }} only accepts a single simple value.
nl: Het veld {{ field }} accepteert alleen één eenvoudige waarde.

source: The lower range value {{ lower }} should be lower than the upper range value {{ upper }}.
nl: De onderste bereik waarde {{ lower }} moet lager zijn dan de bovenste bereik waarde {{ upper }}.

source: This group exceeds maximum nesting level of {{ max }}.
nl: Deze groep overschrijdt het maximale nestingsniveau van {{ max }}.

source: This group exceeds maximum number of groups {{ max }}.
nl: Deze groep overschrijdt maximum aantal groepen {{ max }}.

source: This value exceeds the maximum number of values. Maximum values are {{ max }}.
nl: Deze waarde overschrijdt het maximum aantal waarden. Maximale waardes zijn {{ max }}.

source: The field {{ field }} does not accept {{ type }} values.
nl: Het veld {{ field }} accepteert geen {{ type }} waarden.

source: This value is not a valid birthday or age.
nl: Deze waarde is geen geldige leeftijd of geboortedatum.

source: This value is not a valid birthday.
nl: Deze waarde is geen geldige geboortedatum.

source: This value is not a valid datetime or date interval.
nl: Deze waarde is geen geldige datum-tijd of datuminterval.

source: This value is not a valid datetime.
nl: Deze waarde is geen geldige datum en tijd.

source: This value is not a valid sorting direction. Accepted directions are: {{ directions }}.
nl: Deze waarde is geen geldige sorteer richting. De geaccepteerde richtingen zijn: {{ directions }}.

# ORDER_CLAUSE_NOT_IN_GROUP
source: Order clauses cannot be placed in a group.
nl: Volgorde clausules kunnen niet in een groep worden geplaatst.
